Merge remote-tracking branch 'origin/feat/book-mvp/trust-by-design'
